{
  "basics": {
    "name": "Jonathan Schneider",
    "label": "iOS Developer",
    "email": "jon@jonschneider.me",
    "phone": "c. (937) 903-1625",
    "location": {
      "city": "Cincinnati, OH"
    },
    "summary": "Experienced iOS Developer with a background in User-facing Application and Developer-facing SDK development.",
    "profiles": [
      {
        "network": "GitHub",
        "username": "Jon-Schneider",
        "url": "https://github.com/Jon-Schneider"
      },
      {
        "network": "LinkedIn",
        "username": "joncschneider",
        "url": "https://www.linkedin.com/in/joncschneider"
      }
    ]
  },
  "work": [
    {
      "company": "Lisnr",
      "position": "iOS Engineer",
      "startDate": "February 2015",
      "endDate": "Present",
      "highlights": [
        "Extensively rebuilt and then maintained Lisnr iOS SDK as the sole iOS Developer at Lisnr. Responsible for implementing SDK feature changes, bug fixes, testing, and deployment.",
        "Implemented iOS Applications and custom Application components for several high-profile clients including the Budweiser Made in America Music Festival and three major-league Professional Sports Teams.",
        "App Honors: The 2015 Budweiser Made in America Music Festival Applications were a finalist for the 2016 SXSW Music & Audio Innovation Award.",
        "Developed iOS portion of an internal mobile SDK used to quickly build and theme custom native applications for music festivals. iOS applications based on this SDK saw over half a million sessions across all iOS client applications in 2015.",
        "Designed and implemented an extensive Functional Test Suite for the Lisnr iOS SDK using Specta, Expecta, OCHamcrest, OCMockito, and Nocilla.",
        "Assumed additional Android development responsibilities during Q1 2016. Worked with a collegue to rewrite the Lisnr Android SDK from scratch. The final product had a codebase just half the length of the prior version without any feature loss.",
        "Developed and released (open source) the first Swift in-app notification library for iOS, LNRSimpleNotifications.",
        "Primarily worked in a sprint-based Agile development process."
      ]
    },
    {
      "company": "Z-Prototype",
      "position": "Founder, CEO, iOS Developer",
      "startDate": "August 2012",
      "endDate": "December 2014",
      "highlights": [
        "Developed over two dozen iPhone and iPad Mobile applications.",
        "App Honors: Two applications featured as “Best New Apps” on the Apple App Store. One application ranked in the top 10 Paid Productivity apps. One application that was ranked in the top 10 Paid Social Networking apps. One application that was featured by Entrepreneur.com.",
        "Secured over a dozen clients ranging in size from small agencies to the entire North American division of a $500 million corporation.",
        "Managed a team of up to 4 part-time developers."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Dayton",
      "area": "Logistics and Supply Chain Management and Entrepreneurship",
      "studyType": "Bachelor of Science",
      "startDate": "August 2008",
      "endDate": "May 2012",
      "gpa": "3.15"
    },
    {
      "institution": "Sinclair Community College",
      "area": "Computer Information Systems, Web Development",
      "studyType": "Associate Degree",
      "startDate": "January 2012",
      "endDate": "August 2012",
      "gpa": "3.94"
    }
  ],
  "awards": [
    {
      "title": "Eagle Scout",
      "date": "January 2008"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "details": [
          { "text": "Objective-C", "comment": "4 years" },
          { "text": "Swift", "comment": "2" },
          { "text": "Ruby", "comment": "1" },
          { "text": "Java", "comment": "1" }
      ]
    }
  ]
}
